     H option(*nodebugio) datfmt(*iso)
     D* Variable definition
     D wwout           s             20a
     D wwdstamp        s               z   inz(*sys)
     C* Program start
     C     '------------'dsply
     C     wwdstamp      dsply
     C                   eval      *inlr = *on
