     F* File definition
     Fmyfilek   IF   E           k disk
     D* Variable definition
     Dwwid             s              4s 0
     C* Program start
     C                   eval      wwid = 2
     C     wwid          chain     myfilek                            80
     C                   if        *in80 = *off
     C     fld1          dsply
     C                   endif
     C                   eval      *inlr = *on
