     H dftactgrp(*no)
     D wwarr           s              4s 0 dim(5) ctdata perrcd(1)
     D i               s              2s 0
       for i = 1 to 5;
        dsply wwarr(i);
       endfor;
       return;
**CTDATA WWARR
0010
0020
0030
0040
0050
