     H dftactgrp(*no) main(mainp)
     Dmainp            pr                  extpgm('MAINPROCT1')
     D                                1p 0
     H*
     Pmainp            b
     D                 pi
     D pa1                            1p 0
     C     pa1           dsply
     P                 e
